Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/armcc/armcc/startup_pic32cz4010ca90100.s
; Reset Handler

Reset_Handler   PROC
                EXPORT  Reset_Handler             [WEAK]
                IMPORT  SystemInit
                IMPORT  __main
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__main
                BX      R0
                ENDP


; Dummy Exception Handlers (infinite loops which can be modified)

NonMaskableInt_Handler    PROC
                          EXPORT NonMaskableInt_Handler    [WEAK] 
                          B       .
                          ENDP
HardFault_Handler         PROC
                          EXPORT HardFault_Handler         [WEAK] 
                          B       .
                          ENDP
MemoryManagement_Handler  PROC
                          EXPORT MemoryManagement_Handler  [WEAK] 
                          B       .
                          ENDP
BusFault_Handler          PROC
                          EXPORT BusFault_Handler          [WEAK] 
                          B       .
                          ENDP
UsageFault_Handler        PROC
                          EXPORT UsageFault_Handler        [WEAK] 
                          B       .
                          ENDP
SVC_Handler               PROC
                          EXPORT SVC_Handler               [WEAK] 
                          B       .
                          ENDP
DebugMonitor_Handler      PROC
                          EXPORT DebugMonitor_Handler      [WEAK] 
                          B       .
                          ENDP
PendSV_Handler            PROC
                          EXPORT PendSV_Handler            [WEAK] 
                          B       .
                          ENDP
SysTick_Handler           PROC
                          EXPORT SysTick_Handler           [WEAK] 
                          B       .
                          ENDP

Default_Handler PROC
                EXPORT  FCW_Handler               [WEAK]
                EXPORT  FCR_ECCERR_Handler        [WEAK]
                EXPORT  FCR_CRC_FAULT_Handler     [WEAK]
                EXPORT  PM_Handler                [WEAK]
                EXPORT  SUPC_Handler              [WEAK]
                EXPORT  OSCCTRL_FAIL_Handler      [WEAK]
                EXPORT  OSCCTRL_XOSCRDY_Handler   [WEAK]
                EXPORT  OSCCTRL_DFLLRDY_Handler   [WEAK]
                EXPORT  OSCCTRL_OTHER_Handler     [WEAK]
                EXPORT  OSCCTRL_LOCK_Handler      [WEAK]
                EXPORT  OSC32KCTRL_FAIL_Handler   [WEAK]
                EXPORT  OSC32KCTRL_RDY_Handler    [WEAK]
                EXPORT  MCLK_Handler              [WEAK]
                EXPORT  FREQM_Handler             [WEAK]
                EXPORT  WDT_Handler               [WEAK]
                EXPORT  RTC_TAMPER_Handler        [WEAK]
                EXPORT  RTC_OVF_Handler           [WEAK]
                EXPORT  RTC_PERIOD_Handler        [WEAK]
                EXPORT  RTC_COMPARE_Handler       [WEAK]
                EXPORT  EIC_EXTINT_0_Handler      [WEAK]
                EXPORT  EIC_EXTINT_1_Handler      [WEAK]
                EXPORT  EIC_EXTINT_2_Handler      [WEAK]
                EXPORT  EIC_EXTINT_3_Handler      [WEAK]
                EXPORT  EIC_EXTINT_4_Handler      [WEAK]
                EXPORT  EIC_EXTINT_5_Handler      [WEAK]
                EXPORT  EIC_EXTINT_6_Handler      [WEAK]
                EXPORT  EIC_EXTINT_7_Handler      [WEAK]
                EXPORT  EIC_EXTINT_8_Handler      [WEAK]
                EXPORT  EIC_EXTINT_9_Handler      [WEAK]
                EXPORT  EIC_EXTINT_10_Handler     [WEAK]
                EXPORT  EIC_EXTINT_11_Handler     [WEAK]
                EXPORT  EIC_EXTINT_12_Handler     [WEAK]
                EXPORT  EIC_EXTINT_13_Handler     [WEAK]
                EXPORT  EIC_EXTINT_14_Handler     [WEAK]
                EXPORT  EIC_EXTINT_15_Handler     [WEAK]
                EXPORT  PAC_Handler               [WEAK]
                EXPORT  DRMTCM_Handler            [WEAK]
                EXPORT  MCRAMC_Handler            [WEAK]
                EXPORT  TRAM_Handler              [WEAK]
                EXPORT  DMA_PRI3_Handler          [WEAK]
                EXPORT  DMA_PRI2_Handler          [WEAK]
                EXPORT  DMA_PRI1_Handler          [WEAK]
                EXPORT  DMA_PRI0_Handler          [WEAK]
                EXPORT  EVSYS_0_Handler           [WEAK]
                EXPORT  EVSYS_1_Handler           [WEAK]
                EXPORT  EVSYS_2_Handler           [WEAK]
                EXPORT  EVSYS_3_Handler           [WEAK]
                EXPORT  EVSYS_4_Handler           [WEAK]
                EXPORT  EVSYS_5_Handler           [WEAK]
                EXPORT  EVSYS_6_Handler           [WEAK]
                EXPORT  EVSYS_7_Handler           [WEAK]
                EXPORT  EVSYS_8_Handler           [WEAK]
                EXPORT  EVSYS_9_Handler           [WEAK]
                EXPORT  EVSYS_10_Handler          [WEAK]
                EXPORT  EVSYS_11_Handler          [WEAK]
                EXPORT  SERCOM0_6_Handler         [WEAK]
                EXPORT  SERCOM0_5_Handler         [WEAK]
                EXPORT  SERCOM0_0_Handler         [WEAK]
                EXPORT  SERCOM0_1_Handler         [WEAK]
                EXPORT  SERCOM0_2_Handler         [WEAK]
                EXPORT  SERCOM0_3_Handler         [WEAK]
                EXPORT  SERCOM0_4_Handler         [WEAK]
                EXPORT  SERCOM1_6_Handler         [WEAK]
                EXPORT  SERCOM1_5_Handler         [WEAK]
                EXPORT  SERCOM1_0_Handler         [WEAK]
                EXPORT  SERCOM1_1_Handler         [WEAK]
                EXPORT  SERCOM1_2_Handler         [WEAK]
                EXPORT  SERCOM1_3_Handler         [WEAK]
                EXPORT  SERCOM1_4_Handler         [WEAK]
                EXPORT  SERCOM2_6_Handler         [WEAK]
                EXPORT  SERCOM2_5_Handler         [WEAK]
                EXPORT  SERCOM2_0_Handler         [WEAK]
                EXPORT  SERCOM2_1_Handler         [WEAK]
                EXPORT  SERCOM2_2_Handler         [WEAK]
                EXPORT  SERCOM2_3_Handler         [WEAK]
                EXPORT  SERCOM2_4_Handler         [WEAK]
                EXPORT  SERCOM3_6_Handler         [WEAK]
                EXPORT  SERCOM3_5_Handler         [WEAK]
                EXPORT  SERCOM3_0_Handler         [WEAK]
                EXPORT  SERCOM3_1_Handler         [WEAK]
                EXPORT  SERCOM3_2_Handler         [WEAK]
                EXPORT  SERCOM3_3_Handler         [WEAK]
                EXPORT  SERCOM3_4_Handler         [WEAK]
                EXPORT  TCC0_OTHER_Handler        [WEAK]
                EXPORT  TCC0_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC0_MC0_Handler          [WEAK]
                EXPORT  TCC0_MC1_Handler          [WEAK]
                EXPORT  TCC0_MC2_Handler          [WEAK]
                EXPORT  TCC0_MC3_Handler          [WEAK]
                EXPORT  TCC0_MC4_Handler          [WEAK]
                EXPORT  TCC0_MC5_Handler          [WEAK]
                EXPORT  TCC0_MC6_Handler          [WEAK]
                EXPORT  TCC0_MC7_Handler          [WEAK]
                EXPORT  TCC1_OTHER_Handler        [WEAK]
                EXPORT  TCC1_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC1_MC0_Handler          [WEAK]
                EXPORT  TCC1_MC1_Handler          [WEAK]
                EXPORT  TCC1_MC2_Handler          [WEAK]
                EXPORT  TCC1_MC3_Handler          [WEAK]
                EXPORT  TCC1_MC4_Handler          [WEAK]
                EXPORT  TCC1_MC5_Handler          [WEAK]
                EXPORT  TCC1_MC6_Handler          [WEAK]
                EXPORT  TCC1_MC7_Handler          [WEAK]
                EXPORT  TCC2_OTHER_Handler        [WEAK]
                EXPORT  TCC2_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC2_MC0_Handler          [WEAK]
                EXPORT  TCC2_MC1_Handler          [WEAK]
                EXPORT  TCC2_MC2_Handler          [WEAK]
                EXPORT  TCC2_MC3_Handler          [WEAK]
                EXPORT  TCC2_MC4_Handler          [WEAK]
                EXPORT  TCC2_MC5_Handler          [WEAK]
                EXPORT  TCC3_OTHER_Handler        [WEAK]
                EXPORT  TCC3_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC3_MC0_Handler          [WEAK]
                EXPORT  TCC3_MC1_Handler          [WEAK]
                EXPORT  TCC4_OTHER_Handler        [WEAK]
                EXPORT  TCC4_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC4_MC0_Handler          [WEAK]
                EXPORT  TCC4_MC1_Handler          [WEAK]
                EXPORT  TCC5_OTHER_Handler        [WEAK]
                EXPORT  TCC5_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC5_MC0_Handler          [WEAK]
                EXPORT  TCC5_MC1_Handler          [WEAK]
                EXPORT  TCC6_OTHER_Handler        [WEAK]
                EXPORT  TCC6_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC6_MC0_Handler          [WEAK]
                EXPORT  TCC6_MC1_Handler          [WEAK]
                EXPORT  TCC7_OTHER_Handler        [WEAK]
                EXPORT  TCC7_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC7_MC0_Handler          [WEAK]
                EXPORT  TCC7_MC1_Handler          [WEAK]
                EXPORT  TCC8_OTHER_Handler        [WEAK]
                EXPORT  TCC8_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC8_MC0_Handler          [WEAK]
                EXPORT  TCC8_MC1_Handler          [WEAK]
                EXPORT  TCC9_OTHER_Handler        [WEAK]
                EXPORT  TCC9_CNT_TRIG_Handler     [WEAK]
                EXPORT  TCC9_MC0_Handler          [WEAK]
                EXPORT  TCC9_MC1_Handler          [WEAK]
                EXPORT  TCC9_MC2_Handler          [WEAK]
                EXPORT  TCC9_MC3_Handler          [WEAK]
                EXPORT  TCC9_MC4_Handler          [WEAK]
                EXPORT  TCC9_MC5_Handler          [WEAK]
                EXPORT  ADC_GLOBAL_Handler        [WEAK]
                EXPORT  ADC_CORE1_Handler         [WEAK]
                EXPORT  ADC_CORE2_Handler         [WEAK]
                EXPORT  ADC_CORE3_Handler         [WEAK]
                EXPORT  ADC_CORE4_Handler         [WEAK]
                EXPORT  AC_Handler                [WEAK]
                EXPORT  PTC_Handler               [WEAK]
                EXPORT  SPI_IXS0_Handler          [WEAK]
                EXPORT  CAN0_Handler              [WEAK]
                EXPORT  CAN1_Handler              [WEAK]
                EXPORT  ETH_PRI_Q_0_Handler       [WEAK]
                EXPORT  ETH_PRI_Q_1_Handler       [WEAK]
                EXPORT  ETH_PRI_Q_2_Handler       [WEAK]
                EXPORT  ETH_PRI_Q_3_Handler       [WEAK]
                EXPORT  ETH_PRI_Q_4_Handler       [WEAK]
                EXPORT  ETH_PRI_Q_5_Handler       [WEAK]
                EXPORT  SQI0_Handler              [WEAK]
                EXPORT  TRNG_Handler              [WEAK]
                EXPORT  SDMMC0_Handler            [WEAK]
                EXPORT  USBHS0_Handler            [WEAK]
                EXPORT  HSM_TAMPER_Handler        [WEAK]
                EXPORT  HSM_TXINT_Handler         [WEAK]
                EXPORT  HSM_RXINT_Handler         [WEAK]
                EXPORT  MLB_GENERAL_Handler       [WEAK]
                EXPORT  MLB_BUSREQ_Handler        [WEAK]


FCW_Handler              
FCR_ECCERR_Handler       
FCR_CRC_FAULT_Handler    
PM_Handler               
SUPC_Handler             
OSCCTRL_FAIL_Handler     
OSCCTRL_XOSCRDY_Handler  
OSCCTRL_DFLLRDY_Handler  
OSCCTRL_OTHER_Handler    
OSCCTRL_LOCK_Handler     
OSC32KCTRL_FAIL_Handler  
OSC32KCTRL_RDY_Handler   
MCLK_Handler             
FREQM_Handler            
WDT_Handler              
RTC_TAMPER_Handler       
RTC_OVF_Handler          
RTC_PERIOD_Handler       
RTC_COMPARE_Handler      
EIC_EXTINT_0_Handler     
EIC_EXTINT_1_Handler     
EIC_EXTINT_2_Handler     
EIC_EXTINT_3_Handler     
EIC_EXTINT_4_Handler     
EIC_EXTINT_5_Handler     
EIC_EXTINT_6_Handler     
EIC_EXTINT_7_Handler     
EIC_EXTINT_8_Handler     
EIC_EXTINT_9_Handler     
EIC_EXTINT_10_Handler    
EIC_EXTINT_11_Handler    
EIC_EXTINT_12_Handler    
EIC_EXTINT_13_Handler    
EIC_EXTINT_14_Handler    
EIC_EXTINT_15_Handler    
PAC_Handler              
DRMTCM_Handler           
MCRAMC_Handler           
TRAM_Handler             
DMA_PRI3_Handler         
DMA_PRI2_Handler         
DMA_PRI1_Handler         
DMA_PRI0_Handler         
EVSYS_0_Handler          
EVSYS_1_Handler          
EVSYS_2_Handler          
EVSYS_3_Handler          
EVSYS_4_Handler          
EVSYS_5_Handler          
EVSYS_6_Handler          
EVSYS_7_Handler          
EVSYS_8_Handler          
EVSYS_9_Handler          
EVSYS_10_Handler         
EVSYS_11_Handler         
SERCOM0_6_Handler        
SERCOM0_5_Handler        
SERCOM0_0_Handler        
SERCOM0_1_Handler        
SERCOM0_2_Handler        
SERCOM0_3_Handler        
SERCOM0_4_Handler        
SERCOM1_6_Handler        
SERCOM1_5_Handler        
SERCOM1_0_Handler        
SERCOM1_1_Handler        
SERCOM1_2_Handler        
SERCOM1_3_Handler        
SERCOM1_4_Handler        
SERCOM2_6_Handler        
SERCOM2_5_Handler        
SERCOM2_0_Handler        
SERCOM2_1_Handler        
SERCOM2_2_Handler        
SERCOM2_3_Handler        
SERCOM2_4_Handler        
SERCOM3_6_Handler        
SERCOM3_5_Handler        
SERCOM3_0_Handler        
SERCOM3_1_Handler        
SERCOM3_2_Handler        
SERCOM3_3_Handler        
SERCOM3_4_Handler        
TCC0_OTHER_Handler       
TCC0_CNT_TRIG_Handler    
TCC0_MC0_Handler         
TCC0_MC1_Handler         
TCC0_MC2_Handler         
TCC0_MC3_Handler         
TCC0_MC4_Handler         
TCC0_MC5_Handler         
TCC0_MC6_Handler         
TCC0_MC7_Handler         
TCC1_OTHER_Handler       
TCC1_CNT_TRIG_Handler    
TCC1_MC0_Handler         
TCC1_MC1_Handler         
TCC1_MC2_Handler         
TCC1_MC3_Handler         
TCC1_MC4_Handler         
TCC1_MC5_Handler         
TCC1_MC6_Handler         
TCC1_MC7_Handler         
TCC2_OTHER_Handler       
TCC2_CNT_TRIG_Handler    
TCC2_MC0_Handler         
TCC2_MC1_Handler         
TCC2_MC2_Handler         
TCC2_MC3_Handler         
TCC2_MC4_Handler         
TCC2_MC5_Handler         
TCC3_OTHER_Handler       
TCC3_CNT_TRIG_Handler    
TCC3_MC0_Handler         
TCC3_MC1_Handler         
TCC4_OTHER_Handler       
TCC4_CNT_TRIG_Handler    
TCC4_MC0_Handler         
TCC4_MC1_Handler         
TCC5_OTHER_Handler       
TCC5_CNT_TRIG_Handler    
TCC5_MC0_Handler         
TCC5_MC1_Handler         
TCC6_OTHER_Handler       
TCC6_CNT_TRIG_Handler    
TCC6_MC0_Handler         
TCC6_MC1_Handler         
TCC7_OTHER_Handler       
TCC7_CNT_TRIG_Handler    
TCC7_MC0_Handler         
TCC7_MC1_Handler         
TCC8_OTHER_Handler       
TCC8_CNT_TRIG_Handler    
TCC8_MC0_Handler         
TCC8_MC1_Handler         
TCC9_OTHER_Handler       
TCC9_CNT_TRIG_Handler    
TCC9_MC0_Handler         
TCC9_MC1_Handler         
TCC9_MC2_Handler         
TCC9_MC3_Handler         
TCC9_MC4_Handler         
TCC9_MC5_Handler         
ADC_GLOBAL_Handler       
ADC_CORE1_Handler        
ADC_CORE2_Handler        
ADC_CORE3_Handler        
ADC_CORE4_Handler        
AC_Handler               
PTC_Handler              
SPI_IXS0_Handler         
CAN0_Handler             
CAN1_Handler             
ETH_PRI_Q_0_Handler      
ETH_PRI_Q_1_Handler      
ETH_PRI_Q_2_Handler      
ETH_PRI_Q_3_Handler      
ETH_PRI_Q_4_Handler      
ETH_PRI_Q_5_Handler      
SQI0_Handler             
TRNG_Handler             
SDMMC0_Handler           
USBHS0_Handler           
HSM_TAMPER_Handler       
HSM_TXINT_Handler        
HSM_RXINT_Handler        
MLB_GENERAL_Handler      
MLB_BUSREQ_Handler       
                B       .
                ENDP


                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap
__user_initial_stackheap

                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END

